Delans-TLE/src/AccumulationRegisters/ES_НаложенныеПлатежиПартнеров/ES_НаложенныеПлатежиПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ES_НаложенныеПлатежиПартнеров</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>НППлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НПФактНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НПФактБезнал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Принято</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Delans-TLE/src/InformationRegisters/ES_ДанныеПоЗаказам/ES_ДанныеПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_ДанныеПоЗаказам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеЗаказа</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиницаПродажи</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиницаРезерв</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресДоставкиДолгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресДоставкиШирота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресСкладаДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Удалить_ДатаДоставкиПо</name>
    <comment>НЕ ИСПОЛЬЗУЕТСЯ</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДоставки</name>
    <type>
      <types>EnumRef.ES_ВидыДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ВидЗабора</name>
    <type>
      <types>EnumRef.ES_ВидыЗабора</types>
    </type>
  </resources>
  <resources>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ТипыДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВхНакладная</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаказчикИОтправительОдноЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаказчикКонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ЗаказчикТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаборАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаборАдресДолгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаборАдресШирота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаборДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Удалить_ЗаборДатаПо</name>
    <comment>НЕ ИСПОЛЬЗУЕТСЯ</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаборВремяС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаборВремяПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаборОтправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаборКонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаборРегион</name>
    <type>
      <types>CatalogRef.ES_Регионы</types>
    </type>
  </resources>
  <resources>
    <name>ЗаборТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Манифест</name>
    <type>
      <types>CatalogRef.ES_Реестры</types>
    </type>
  </resources>
  <resources>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НППлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщийОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщийОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Плательщик</name>
    <type>
      <types>EnumRef.ES_ТипыПлательщиков</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикТретьеЛицо</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Подтвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеПодтверждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучательКонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучательРегион</name>
    <type>
      <types>CatalogRef.ES_Регионы</types>
    </type>
  </resources>
  <resources>
    <name>ПолучательТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеГрузов</name>
    <type>
      <types>EnumRef.ES_ПредставлениеГрузов</types>
    </type>
  </resources>
  <resources>
    <name>СкладДоставки</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправочноАдресПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправочноЗаказчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СправочноОтправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправочноПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправочноТелПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрочностьДоставки</name>
    <type>
      <types>EnumRef.ES_СрочностьДоставки</types>
    </type>
  </resources>
  <resources>
    <name>Удалить_ИспользоватьЗабор</name>
    <comment>НЕ ИСПОЛЬЗУЕТСЯ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Возврат</name>
    <comment>Признак для схемы Двери-Двери Упрощенный</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Предоплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>ЧекНаОбщуюСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗачетНП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоУточнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Направление</name>
    <type>
      <types>CatalogRef.ES_Направления</types>
    </type>
  </resources>
  <resources>
    <name>Проблема</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/InformationRegisters/ES_СтатусыЗаказов/ES_СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_СтатусыЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.ES_СтатусыЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Удалить_ДатаПоследнегоПроведения</name>
    <comment>НЕ ИСПОЛЬЗУЕТСЯ</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/Enums/ES_ВидыЗачетаПоПлатежамВозврата/ES_ВидыЗачетаПоПлатежамВозврата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ES_ВидыЗачетаПоПлатежамВозврата</name>
  <enumValues>
    <name>УчетРКО</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
</mdclass:Enum>

Delans-TLE/src/CommonForms/ES_ФормаПодбора/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("ВидЗачета") Тогда
	УстановитьВидимостьКолонок(Параметры.ВидЗачета, Параметры.ВидПодбора);
	Иначе  
	УстановитьВидимостьКолонок(Неопределено,Параметры.ВидПодбора);
	КонецЕсли;

	//ЭР Несторук С.И. 14.08.2017 9:52:01 {
	//Организация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
	Организация = Параметры.Организация;
	//}ЭР Несторук С.И.
	
	//ЭР Несторук С.И. 15.09.2017 17:24:54 {
	Если Параметры.ВидПодбора = "ПеремещениеПлатежи" Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Партнер", Параметры.Контрагент);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ES_НаложенныеПлатежиПартнеровОбороты.Заказ,
		|	ЕСТЬNULL(ES_НаложенныеПлатежиПартнеровОбороты.НПФактНалОборот, 0) КАК НПФактНал,
		|	ЕСТЬNULL(ES_НаложенныеПлатежиПартнеровОбороты.НПФактБезналОборот, 0) КАК НПФактБезнал,
		|	ЕСТЬNULL(ES_НаложенныеПлатежиПартнеровОбороты.ОтправленоОборот, 0) КАК Отправлено,
		|	ЕСТЬNULL(ES_НаложенныеПлатежиПартнеровОбороты.ПринятоОборот, 0) КАК Принято
		|ПОМЕСТИТЬ ВТ_НПОбороты
		|ИЗ
		|	РегистрНакопления.ES_НаложенныеПлатежиПартнеров.Обороты(, , , Партнер = &Партнер) КАК ES_НаложенныеПлатежиПартнеровОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НПОбороты.Заказ,
		|	ВТ_НПОбороты.НПФактНал,
		|	ВТ_НПОбороты.НПФактБезнал,
		|	ВТ_НПОбороты.Отправлено
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	ВТ_НПОбороты КАК ВТ_НПОбороты
		|ГДЕ
		|	(ВТ_НПОбороты.НПФактНал > 0
		|			ИЛИ ВТ_НПОбороты.НПФактБезнал > 0)
		|	И ВТ_НПОбороты.Отправлено = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ES_ДанныеПоЗаказамСрезПоследних.Заказ,
		|	ES_ДанныеПоЗаказамСрезПоследних.НомерНакладной,
		|	ES_ДанныеПоЗаказамСрезПоследних.НомерДокумента,
		|	ES_ДанныеПоЗаказамСрезПоследних.ДатаДоставки,
		|	ES_ДанныеПоЗаказамСрезПоследних.ДатаДокумента,
		|	ES_ДанныеПоЗаказамСрезПоследних.ВидДоставки,
		|	ES_ДанныеПоЗаказамСрезПоследних.Получатель,
		|	ES_ДанныеПоЗаказамСрезПоследних.Организация,
		|	ES_ДанныеПоЗаказамСрезПоследних.ОбщийВес,
		|	ES_ДанныеПоЗаказамСрезПоследних.Комментарий,
		|	ES_ДанныеПоЗаказамСрезПоследних.СтоимостьДоставки
		|ПОМЕСТИТЬ ВТ_ДанныеПоЗаказу
		|ИЗ
		|	РегистрСведений.ES_ДанныеПоЗаказам.СрезПоследних(
		|			,
		|			Заказ В
		|				(ВЫБРАТЬ
		|					ВТ_Заказы.Заказ
		|				ИЗ
		|					ВТ_Заказы КАК ВТ_Заказы)) КАК ES_ДанныеПоЗаказамСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ES_СтатусыЗаказовСрезПоследних.Заказ,
		|	ES_СтатусыЗаказовСрезПоследних.СтатусЗаказа
		|ПОМЕСТИТЬ ВТ_СтатусыЗаказов
		|ИЗ
		|	РегистрСведений.ES_СтатусыЗаказов.СрезПоследних(
		|			,
		|			Заказ В
		|				(ВЫБРАТЬ
		|					ВТ_Заказы.Заказ
		|				ИЗ
		|					ВТ_Заказы КАК ВТ_Заказы)) КАК ES_СтатусыЗаказовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Значение КАК Справочник.Ячейки) КАК Ячейка,
		|	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Заказ
		|ПОМЕСТИТЬ ВТ_Ячейка
		|ИЗ
		|	РегистрСведений.ES_ИзменяемыеРеквизитыЗаказов.СрезПоследних(
		|			,
		|			Заказ В
		|					(ВЫБРАТЬ
		|						ВТ_Заказы.Заказ
		|					ИЗ
		|						ВТ_Заказы КАК ВТ_Заказы)
		|				И РеквизитЗаказа = ЗНАЧЕНИЕ(Перечисление.ES_ИзменяемыеРеквизитыЗаказа.Ячейка)) КАК ES_ИзменяемыеРеквизитыЗаказовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заказы.Заказ,
		|	ВТ_Заказы.НПФактНал,
		|	ВТ_Заказы.НПФактБезнал,
		|	ВТ_ДанныеПоЗаказу.НомерНакладной,
		|	ВТ_ДанныеПоЗаказу.НомерДокумента,
		|	ВТ_ДанныеПоЗаказу.ДатаДоставки,
		|	ВТ_ДанныеПоЗаказу.ДатаДокумента,
		|	ВТ_ДанныеПоЗаказу.ВидДоставки,
		|	ВТ_ДанныеПоЗаказу.Получатель,
		|	ВТ_ДанныеПоЗаказу.ОбщийВес КАК Вес,
		|	ВТ_ДанныеПоЗаказу.Комментарий,
		|	ВТ_СтатусыЗаказов.СтатусЗаказа,
		|	ВТ_Ячейка.Ячейка,
		|	ВТ_ДанныеПоЗаказу.СтоимостьДоставки,
		|	ВТ_ДанныеПоЗаказу.СтоимостьДоставки КАК Стоимость,
		|	ВТ_Заказы.Отправлено,
		|	ВТ_Заказы.Заказ.ES_Проблема КАК Проблема
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЗаказу КАК ВТ_ДанныеПоЗаказу
		|		ПО ВТ_Заказы.Заказ = ВТ_ДанныеПоЗаказу.Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыЗаказов КАК ВТ_СтатусыЗаказов
		|		ПО ВТ_Заказы.Заказ = ВТ_СтатусыЗаказов.Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ячейка КАК ВТ_Ячейка
		|		ПО ВТ_Заказы.Заказ = ВТ_Ячейка.Заказ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Касса 	= ES_ОбщегоНазначения.ПолучитьСтартовуюНастройку(Перечисления.ES_ВидыСтартовыхНастроек.КассаНаложенныхПлатежей);
		Счет 	= ES_ОбщегоНазначения.ПолучитьСтартовуюНастройку(Перечисления.ES_ВидыСтартовыхНастроек.ДопКассаНП);
		Пока выборка.Следующий() Цикл 
			НовСтр = СписокЗаказовДоставки.Добавить(); 
			ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
			НовСтр.Касса 	= Касса;
			НовСтр.Счет     = Счет;
		КонецЦикла;
		
		Возврат;
	ИначеЕсли Параметры.ВидПодбора = "ПеремещениеЗаказы" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ES_ЗаказыНаСкладеОстатки.Заказ КАК Заказ
		|ПОМЕСТИТЬ ВТ_ЗаказыНаСкладе
		|ИЗ
		|	РегистрНакопления.ES_ЗаказыНаСкладе.Остатки(
		|			,
		|			Склад = &Склад
		|				И Курьер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК ES_ЗаказыНаСкладеОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗаказыНаСкладе.Заказ КАК Заказ,
		|	ES_ДанныеПоЗаказамСрезПоследних.НомерДокумента КАК НомерДокумента,
		|	ES_ДанныеПоЗаказамСрезПоследних.ДатаДокумента КАК ДатаДокумента,
		|	ES_ДанныеПоЗаказамСрезПоследних.ВидДоставки КАК ВидДоставки,
		|	ES_ДанныеПоЗаказамСрезПоследних.НомерНакладной КАК НомерНакладной,
		|	ES_ДанныеПоЗаказамСрезПоследних.НППлан КАК НППлан,
		|	ES_ДанныеПоЗаказамСрезПоследних.Комментарий КАК Комментарий,
		|	ES_ДанныеПоЗаказамСрезПоследних.СтоимостьДоставки КАК СтоимостьДоставки,
		|	ES_СтатусыЗаказовСрезПоследних.СтатусЗаказа КАК СтатусЗаказа,
		|	ES_ДанныеПоЗаказамСрезПоследних.Организация КАК Организация,
		|	ES_ДанныеПоЗаказамСрезПоследних.Получатель КАК Получатель,
		|	ES_ДанныеПоЗаказамСрезПоследних.ДатаДоставки КАК ДатаДоставки,
		|	ES_ДанныеПоЗаказамСрезПоследних.ОбщийВес КАК ОбщийВес,
		|	ВТ_ЗаказыНаСкладе.Заказ.ES_Проблема КАК ЗаказES_Проблема,
		|	ES_ДанныеПоЗаказамСрезПоследних.АдресДоставки КАК АдресДоставки
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_ЗаказыНаСкладе КАК ВТ_ЗаказыНаСкладе
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ES_ДанныеПоЗаказам.СрезПоследних(
		|				,
		|				Заказ В
		|					(ВЫБРАТЬ
		|						ВТ_ЗаказыНаСкладе.Заказ
		|					ИЗ
		|						ВТ_ЗаказыНаСкладе КАК ВТ_ЗаказыНаСкладе)) КАК ES_ДанныеПоЗаказамСрезПоследних
		|		ПО ВТ_ЗаказыНаСкладе.Заказ = ES_ДанныеПоЗаказамСрезПоследних.Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ES_СтатусыЗаказов.СрезПоследних(
		|				,
		|				Заказ В
		|					(ВЫБРАТЬ
		|						ВТ_ЗаказыНаСкладе.Заказ
		|					ИЗ
		|						ВТ_ЗаказыНаСкладе КАК ВТ_ЗаказыНаСкладе)) КАК ES_СтатусыЗаказовСрезПоследних
		|		ПО ВТ_ЗаказыНаСкладе.Заказ = ES_СтатусыЗаказовСрезПоследних.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.Заказ КАК Заказ,
		|	ВТ_Итог.НомерДокумента КАК НомерЗаказа,
		|	ВТ_Итог.ДатаДокумента КАК ДатаЗаказа,
		|	ВТ_Итог.ВидДоставки КАК ВидДоставки,
		|	ВТ_Итог.НомерНакладной КАК НомерНакладной,
		|	ВТ_Итог.НППлан КАК НППлан,
		|	ВТ_Итог.Комментарий КАК Комментарий,
		|	ВТ_Итог.СтоимостьДоставки КАК СтоимостьДоставки,
		|	ВТ_Итог.СтатусЗаказа КАК СтатусЗаказа,
		|	ВТ_Итог.Организация КАК Организация,
		|	ВТ_Итог.Получатель КАК Получатель,
		|	ВТ_Итог.ДатаДоставки КАК ДатаДоставки,
		|	ВТ_Итог.ОбщийВес КАК Вес,
		|	ВТ_Итог.ЗаказES_Проблема КАК Проблема,
		|	ВТ_Итог.АдресДоставки КАК АдресДоставки
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог";
		
		Запрос.УстановитьПараметр("Склад", Параметры.Склад);
		//Запрос.УстановитьПараметр("Организация", Параметры.Организация);

		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НовСтр = СписокЗаказовДоставки.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
		КонецЦикла;
		
	Возврат;
	
	КонецЕсли;

	
	//КонтрагентОтбора = Параметры.Контрагент;
	   Запрос = Новый Запрос;

		МассивСтатусов = Новый Массив;
		
		Если Параметры.ВидПодбора = "Платежи" Тогда
			Элементы.СписокЗаказовНаДоставкуЧекНаОбщуюСумму.Видимость 	= Истина;
			//Элементы.СписокЗаказовНаДоставкуЗачетНП.Видимость			= Истина;
			Элементы.ОтобранныеЗаказыЧекНаОбщуюСумму.Видимость 			= Истина;
			//Элементы.ОтобранныеЗаказыЗачетНП.Видимость					= Истина;
			
			Элементы.ОтобранныеЗаказыЯчейка.Видимость 			= Ложь;
			Элементы.СписокЗаказовНаДоставкуЯчейка.Видимость 	= Ложь;
			
			СписокЭлементов = СписокЗаказовДоставки;
			
			// Статус для установки параметром запроса	
			МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.ДоставленРассчитать);
			МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.ЧастичноДоставленРассчитать);
			//ЕФСОЛ Несторук 09-12-16 +
			МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.ВозвращенРассчитать);
			//ЕФСОЛ Несторук 09-12-16 -
			
			 //ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.Заказ,
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.ДатаДокумента КАК Дата,
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.НомерДокумента КАК Номер,
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.ДатаДоставки,
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.ВидДоставки,
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.Организация,
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.Заказчик,
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.Получатель,
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.НомерНакладной,
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.ОбщийВес,
			 //               |	ЕСТЬNULL(ES_СтатусыЗаказовСрезПоследних.СтатусЗаказа, НЕОПРЕДЕЛЕНО) КАК СтатусЗаказа,
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.СтоимостьДоставки,
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.Плательщик,
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.ЧекНаОбщуюСумму,
			 //               |	ES_ДанныеПоЗаказамСрезПоследних.ЗачетНП
			 //               |ПОМЕСТИТЬ ВТ
			 //               |ИЗ
			 //               |	РегистрСведений.ES_ДанныеПоЗаказам.СрезПоследних(
			 //               |			,
			 //               |			ВЫБОР
			 //               |					КОГДА Плательщик = ЗНАЧЕНИЕ(Перечисление.ES_ТипыПлательщиков.Получатель)
			 //               |						ТОГДА СправочноЗаказчик = &Контрагент
			 //               |					ИНАЧЕ Заказчик = &Контрагент
			 //               |				КОНЕЦ
			 //               |				И Организация = &Организация) КАК ES_ДанныеПоЗаказамСрезПоследних
			 //               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ES_СтатусыЗаказов.СрезПоследних(, ) КАК ES_СтатусыЗаказовСрезПоследних
			 //               |		ПО ES_ДанныеПоЗаказамСрезПоследних.Заказ = ES_СтатусыЗаказовСрезПоследних.Заказ
			 //               |ГДЕ
			 //               |	ES_СтатусыЗаказовСрезПоследних.СтатусЗаказа В(&МассивСтатусов)
			 //               |;
			 //               |
			 //               |////////////////////////////////////////////////////////////////////////////////
			 //               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 //               |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Заказ,
			 //               |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Значение КАК КассаНП
			 //               |ПОМЕСТИТЬ ВТ_Касса
			 //               |ИЗ
			 //               |	РегистрСведений.ES_ИзменяемыеРеквизитыЗаказов.СрезПоследних(
			 //               |			,
			 //               |			Заказ В
			 //               |					(ВЫБРАТЬ
			 //               |						ВТ.Заказ
			 //               |					ИЗ
			 //               |						ВТ КАК ВТ)
			 //               |				И РеквизитЗаказа = ЗНАЧЕНИЕ(Перечисление.ES_ИзменяемыеРеквизитыЗаказа.Касса)) КАК ES_ИзменяемыеРеквизитыЗаказовСрезПоследних
			 //               |;
			 //               |
			 //               |////////////////////////////////////////////////////////////////////////////////
			 //               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 //               |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Заказ,
			 //               |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Значение КАК КассаНП
			 //               |ПОМЕСТИТЬ ВТ_Счет
			 //               |ИЗ
			 //               |	РегистрСведений.ES_ИзменяемыеРеквизитыЗаказов.СрезПоследних(
			 //               |			,
			 //               |			Заказ В
			 //               |					(ВЫБРАТЬ
			 //               |						ВТ.Заказ
			 //               |					ИЗ
			 //               |						ВТ КАК ВТ)
			 //               |				И РеквизитЗаказа = ЗНАЧЕНИЕ(Перечисление.ES_ИзменяемыеРеквизитыЗаказа.Счет)) КАК ES_ИзменяемыеРеквизитыЗаказовСрезПоследних
			 //               |;
			 //               |
			 //               |////////////////////////////////////////////////////////////////////////////////
			 //               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 //               |	ES_НаложенныеПлатежиОстаткиИОбороты.Заказчик,
			 //               |	ES_НаложенныеПлатежиОстаткиИОбороты.Заказ,
			 //               |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНППриход КАК СуммаНППлатеж,
			 //               |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНП_НалПриход КАК СуммаНППлатежНал,
			 //               |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНП_БезналПриход КАК СуммаНППлатежБезнал,
			 //               |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНП_НалКонечныйОстаток,
			 //               |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНП_БезналКонечныйОстаток
			 //               |ПОМЕСТИТЬ ВТ_НП
			 //               |ИЗ
			 //               |	РегистрНакопления.ES_НаложенныеПлатежи.ОстаткиИОбороты(
			 //               |			,
			 //               |			,
			 //               |			,
			 //               |			,
			 //               |			Заказ В
			 //               |				(ВЫБРАТЬ
			 //               |					ВТ.Заказ
			 //               |				ИЗ
			 //               |					ВТ КАК ВТ)) КАК ES_НаложенныеПлатежиОстаткиИОбороты
			 //               |;
			 //               |
			 //               |////////////////////////////////////////////////////////////////////////////////
			 //               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 //               |	ВТ.Заказ КАК Заказ,
			 //               |	ВТ.Дата КАК ДатаЗаказа,
			 //               |	ВТ.Номер КАК НомерЗаказа,
			 //               |	ВТ.ДатаДоставки КАК ДатаДоставки,
			 //               |	ВТ.ВидДоставки КАК ВидДоставки,
			 //               |	ВТ.Организация КАК Организация,
			 //               |	ВТ.НомерНакладной КАК НомерНакладной,
			 //               |	ВТ.Получатель КАК Получатель,
			 //               |	ВТ.СтатусЗаказа,
			 //               |	ВТ.ОбщийВес КАК Вес,
			 //               |	ЕСТЬNULL(ВТ_Касса.КассаНП, НЕОПРЕДЕЛЕНО) КАК Касса,
			 //               |	ЕСТЬNULL(ВТ_Счет.КассаНП, НЕОПРЕДЕЛЕНО) КАК Счет,
			 //               |	ЕСТЬNULL(ВТ_НП.СуммаНППлатеж, 0) КАК НПФакт,
			 //               |	ЕСТЬNULL(ВТ_НП.СуммаНППлатежНал, 0) КАК НПФактНал_1,
			 //               |	ЕСТЬNULL(ВТ_НП.СуммаНППлатежБезнал, 0) КАК НПФактБезнал_1,
			 //               |	ЕСТЬNULL(ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Значение, """") КАК Комментарий,
			 //               |	ЕСТЬNULL(ВТ_НП.СуммаНП_НалКонечныйОстаток, 0) КАК НПФактНал,
			 //               |	ЕСТЬNULL(ВТ_НП.СуммаНП_БезналКонечныйОстаток, 0) КАК НПФактБезнал,
			 //               |	ВТ.СтоимостьДоставки КАК Стоимость,
			 //               |	ВТ.Плательщик КАК Плательщик,
			 //               |	ВТ.ЧекНаОбщуюСумму,
			 //               |	ВТ.ЗачетНП
			 //               |ПОМЕСТИТЬ Вт_Общая
			 //               |ИЗ
			 //               |	ВТ КАК ВТ
			 //               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Касса КАК ВТ_Касса
			 //               |		ПО ВТ.Заказ = ВТ_Касса.Заказ
			 //               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Счет КАК ВТ_Счет
			 //               |		ПО ВТ.Заказ = ВТ_Счет.Заказ
			 //               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НП КАК ВТ_НП
			 //               |		ПО ВТ.Заказ = ВТ_НП.Заказ
			 //               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ES_ИзменяемыеРеквизитыЗаказов.СрезПоследних(
			 //               |				,
			 //               |				Заказ В
			 //               |						(ВЫБРАТЬ
			 //               |							ВТ.Заказ
			 //               |						ИЗ
			 //               |							ВТ КАК ВТ)
			 //               |					И РеквизитЗаказа = ЗНАЧЕНИЕ(Перечисление.ES_ИзменяемыеРеквизитыЗаказа.Комментарий)) КАК ES_ИзменяемыеРеквизитыЗаказовСрезПоследних
			 //               |		ПО ВТ.Заказ = ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Заказ
			 //               |;
			 //               |
			 //               |////////////////////////////////////////////////////////////////////////////////
			 //               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 //               |	Вт_Общая.Заказ КАК Заказ,
			 //               |	Вт_Общая.НПФактНал КАК НПФактНал,
			 //               |	Вт_Общая.НПФактНал_1,
			 //               |	NULL КАК НПФактБезнал,
			 //               |	NULL КАК НПФактБезнал_1,
			 //               |	Вт_Общая.ДатаЗаказа КАК ДатаЗаказа,
			 //               |	Вт_Общая.НомерЗаказа КАК НомерЗаказа,
			 //               |	Вт_Общая.ДатаДоставки КАК ДатаДоставки,
			 //               |	Вт_Общая.ВидДоставки КАК ВидДоставки,
			 //               |	Вт_Общая.Организация КАК Организация,
			 //               |	Вт_Общая.НомерНакладной КАК НомерНакладной,
			 //               |	Вт_Общая.Получатель КАК Получатель,
			 //               |	Вт_Общая.СтатусЗаказа КАК СтатусЗаказа,
			 //               |	Вт_Общая.Вес КАК Вес,
			 //               |	Вт_Общая.Касса КАК Касса,
			 //               |	NULL КАК Счет,
			 //               |	Вт_Общая.Комментарий КАК Комментарий,
			 //               |	Вт_Общая.Стоимость КАК Стоимость,
			 //               |	Вт_Общая.Плательщик КАК Плательщик,
			 //               |	Вт_Общая.ЧекНаОбщуюСумму,
			 //               |	Вт_Общая.ЗачетНП
			 //               |ПОМЕСТИТЬ ВТ_Итог
			 //               |ИЗ
			 //               |	Вт_Общая КАК Вт_Общая
			 //               |ГДЕ
			 //               |	Вт_Общая.НПФактНал > 0
			 //               |
			 //               |ОБЪЕДИНИТЬ ВСЕ
			 //               |
			 //               |ВЫБРАТЬ
			 //               |	Вт_Общая.Заказ,
			 //               |	NULL,
			 //               |	NULL,
			 //               |	Вт_Общая.НПФактБезнал,
			 //               |	Вт_Общая.НПФактБезнал_1,
			 //               |	Вт_Общая.ДатаЗаказа,
			 //               |	Вт_Общая.НомерЗаказа,
			 //               |	Вт_Общая.ДатаДоставки,
			 //               |	Вт_Общая.ВидДоставки,
			 //               |	Вт_Общая.Организация,
			 //               |	Вт_Общая.НомерНакладной,
			 //               |	Вт_Общая.Получатель,
			 //               |	Вт_Общая.СтатусЗаказа,
			 //               |	Вт_Общая.Вес,
			 //               |	NULL,
			 //               |	Вт_Общая.Счет,
			 //               |	Вт_Общая.Комментарий,
			 //               |	Вт_Общая.Стоимость,
			 //               |	Вт_Общая.Плательщик,
			 //               |	Вт_Общая.ЧекНаОбщуюСумму,
			 //               |	Вт_Общая.ЗачетНП
			 //               |ИЗ
			 //               |	Вт_Общая КАК Вт_Общая
			 //               |ГДЕ
			 //               |	Вт_Общая.НПФактБезнал > 0
			 //               |;
			 //               |
			 //               |////////////////////////////////////////////////////////////////////////////////
			 //               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 //               |	ВТ_Итог.Заказ,
			 //               |	ВТ_Итог.НПФактНал,
			 //               |	ВТ_Итог.НПФактНал_1,
			 //               |	ВТ_Итог.НПФактБезнал,
			 //               |	ВТ_Итог.НПФактБезнал_1,
			 //               |	ВТ_Итог.ДатаЗаказа,
			 //               |	ВТ_Итог.НомерЗаказа,
			 //               |	ВТ_Итог.ДатаДоставки,
			 //               |	ВТ_Итог.ВидДоставки,
			 //               |	ВТ_Итог.Организация,
			 //               |	ВТ_Итог.НомерНакладной,
			 //               |	ВТ_Итог.Получатель,
			 //               |	ВТ_Итог.СтатусЗаказа,
			 //               |	ВТ_Итог.Вес,
			 //               |	ВТ_Итог.Касса,
			 //               |	ВТ_Итог.Счет,
			 //               |	ВТ_Итог.Комментарий,
			 //               |	ВТ_Итог.Стоимость,
			 //               |	ВТ_Итог.Плательщик,
			 //               |	ВТ_Итог.ЧекНаОбщуюСумму,
			 //               |	ВТ_Итог.ЗачетНП
			 //               |ИЗ
			 //               |	ВТ_Итог КАК ВТ_Итог
			 //               |ГДЕ
			 //               |	ВЫБОР
			 //               |			КОГДА ЕСТЬNULL(ВТ_Итог.НПФактНал, 0) > 0
			 //               |				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
			 //               |			КОГДА ЕСТЬNULL(ВТ_Итог.НПФактБезнал, 0) > 0
			 //               |				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
			 //               |			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПустаяСсылка)
			 //               |		КОНЕЦ = &ВидОплаты";
			 
			 ТекстЗапроса = 
			 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 |	ES_ДанныеПоЗаказамСрезПоследних.Заказ КАК Заказ,
			 |	ES_ДанныеПоЗаказамСрезПоследних.ДатаДокумента КАК Дата,
			 |	ES_ДанныеПоЗаказамСрезПоследних.НомерДокумента КАК Номер,
			 |	ES_ДанныеПоЗаказамСрезПоследних.ДатаДоставки КАК ДатаДоставки,
			 |	ES_ДанныеПоЗаказамСрезПоследних.ВидДоставки КАК ВидДоставки,
			 |	ES_ДанныеПоЗаказамСрезПоследних.Организация КАК Организация,
			 |	ES_ДанныеПоЗаказамСрезПоследних.Заказчик КАК Заказчик,
			 |	ES_ДанныеПоЗаказамСрезПоследних.Получатель КАК Получатель,
			 |	ES_ДанныеПоЗаказамСрезПоследних.НомерНакладной КАК НомерНакладной,
			 |	ES_ДанныеПоЗаказамСрезПоследних.ОбщийВес КАК ОбщийВес,
			 |	ЕСТЬNULL(ES_СтатусыЗаказовСрезПоследних.СтатусЗаказа, НЕОПРЕДЕЛЕНО) КАК СтатусЗаказа,
			 |	ES_ДанныеПоЗаказамСрезПоследних.СтоимостьДоставки КАК СтоимостьДоставки,
			 |	ES_ДанныеПоЗаказамСрезПоследних.Плательщик КАК Плательщик,
			 |	ES_ДанныеПоЗаказамСрезПоследних.ЧекНаОбщуюСумму КАК ЧекНаОбщуюСумму,
			 |	ES_ДанныеПоЗаказамСрезПоследних.ЗачетНП КАК ЗачетНП,
			 |	ЕСТЬNULL(ВЫРАЗИТЬ(ES_ИзменяемыеРеквизитыЗаказовДоставкаПартнером.Значение КАК БУЛЕВО), ЛОЖЬ) КАК ДоставкаПартнером
			 |ПОМЕСТИТЬ ВТ
			 |ИЗ
			 |	РегистрСведений.ES_ДанныеПоЗаказам.СрезПоследних(
			 |			,
			 |			Заказчик = &Контрагент
			 |				И Организация = &Организация) КАК ES_ДанныеПоЗаказамСрезПоследних
			 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ES_СтатусыЗаказов.СрезПоследних(, ) КАК ES_СтатусыЗаказовСрезПоследних
			 |		ПО ES_ДанныеПоЗаказамСрезПоследних.Заказ = ES_СтатусыЗаказовСрезПоследних.Заказ
			 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ES_ИзменяемыеРеквизитыЗаказов.СрезПоследних(, РеквизитЗаказа = ЗНАЧЕНИЕ(Перечисление.ES_ИзменяемыеРеквизитыЗаказа.ДоставкаПартнером)) КАК ES_ИзменяемыеРеквизитыЗаказовДоставкаПартнером
			 |		ПО ES_ДанныеПоЗаказамСрезПоследних.Заказ = ES_ИзменяемыеРеквизитыЗаказовДоставкаПартнером.Заказ
			 |ГДЕ
			 |	ES_СтатусыЗаказовСрезПоследних.СтатусЗаказа В(&МассивСтатусов)
			 |;
			 |
			 |////////////////////////////////////////////////////////////////////////////////
			 |ВЫБРАТЬ
			 |	ВТ.Заказ КАК Заказ,
			 |	ВТ.Дата КАК Дата,
			 |	ВТ.Номер КАК Номер,
			 |	ВТ.ДатаДоставки КАК ДатаДоставки,
			 |	ВТ.ВидДоставки КАК ВидДоставки,
			 |	ВТ.Организация КАК Организация,
			 |	ВТ.Заказчик КАК Заказчик,
			 |	ВТ.Получатель КАК Получатель,
			 |	ВТ.НомерНакладной КАК НомерНакладной,
			 |	ВТ.ОбщийВес КАК ОбщийВес,
			 |	ВТ.СтатусЗаказа КАК СтатусЗаказа,
			 |	ВТ.СтоимостьДоставки КАК СтоимостьДоставки,
			 |	ВТ.Плательщик КАК Плательщик,
			 |	ВТ.ЧекНаОбщуюСумму КАК ЧекНаОбщуюСумму,
			 |	ВТ.ЗачетНП КАК ЗачетНП,
			 |	ВТ.ДоставкаПартнером КАК ДоставкаПартнером
			 |ПОМЕСТИТЬ ВТ_ДоставкаПартнерами
			 |ИЗ
			 |	ВТ КАК ВТ
			 |ГДЕ
			 |	ВТ.ДоставкаПартнером
			 |;
			 |
			 |////////////////////////////////////////////////////////////////////////////////
			 |ВЫБРАТЬ
			 |	ВТ.Заказ КАК Заказ,
			 |	ВТ.Дата КАК Дата,
			 |	ВТ.Номер КАК Номер,
			 |	ВТ.ДатаДоставки КАК ДатаДоставки,
			 |	ВТ.ВидДоставки КАК ВидДоставки,
			 |	ВТ.Организация КАК Организация,
			 |	ВТ.Заказчик КАК Заказчик,
			 |	ВТ.Получатель КАК Получатель,
			 |	ВТ.НомерНакладной КАК НомерНакладной,
			 |	ВТ.ОбщийВес КАК ОбщийВес,
			 |	ВТ.СтатусЗаказа КАК СтатусЗаказа,
			 |	ВТ.СтоимостьДоставки КАК СтоимостьДоставки,
			 |	ВТ.Плательщик КАК Плательщик,
			 |	ВТ.ЧекНаОбщуюСумму КАК ЧекНаОбщуюСумму,
			 |	ВТ.ЗачетНП КАК ЗачетНП,
			 |	ВТ.ДоставкаПартнером КАК ДоставкаПартнером
			 |ПОМЕСТИТЬ ВТ_НеДоставкаПартнерами
			 |ИЗ
			 |	ВТ КАК ВТ
			 |ГДЕ
			 |	НЕ ВТ.ДоставкаПартнером
			 |;
			 |
			 |////////////////////////////////////////////////////////////////////////////////
			 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Заказ КАК Заказ,
			 |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Значение КАК КассаНП
			 |ПОМЕСТИТЬ ВТ_Касса
			 |ИЗ
			 |	РегистрСведений.ES_ИзменяемыеРеквизитыЗаказов.СрезПоследних(
			 |			,
			 |			Заказ В
			 |					(ВЫБРАТЬ
			 |						ВТ.Заказ
			 |					ИЗ
			 |						ВТ КАК ВТ)
			 |				И РеквизитЗаказа = ЗНАЧЕНИЕ(Перечисление.ES_ИзменяемыеРеквизитыЗаказа.Касса)) КАК ES_ИзменяемыеРеквизитыЗаказовСрезПоследних
			 |;
			 |
			 |////////////////////////////////////////////////////////////////////////////////
			 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Заказ КАК Заказ,
			 |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Значение КАК КассаНП
			 |ПОМЕСТИТЬ ВТ_Счет
			 |ИЗ
			 |	РегистрСведений.ES_ИзменяемыеРеквизитыЗаказов.СрезПоследних(
			 |			,
			 |			Заказ В
			 |					(ВЫБРАТЬ
			 |						ВТ.Заказ
			 |					ИЗ
			 |						ВТ КАК ВТ)
			 |				И РеквизитЗаказа = ЗНАЧЕНИЕ(Перечисление.ES_ИзменяемыеРеквизитыЗаказа.Счет)) КАК ES_ИзменяемыеРеквизитыЗаказовСрезПоследних
			 |;
			 |
			 |////////////////////////////////////////////////////////////////////////////////
			 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 |	ES_НаложенныеПлатежиОстаткиИОбороты.Заказчик КАК Заказчик,
			 |	ES_НаложенныеПлатежиОстаткиИОбороты.Заказ КАК Заказ,
			 |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНППриход КАК СуммаНППлатеж,
			 |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНП_НалПриход КАК СуммаНППлатежНал,
			 |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНП_БезналПриход КАК СуммаНППлатежБезнал,
			 |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНП_НалКонечныйОстаток КАК СуммаНП_НалКонечныйОстаток,
			 |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНП_БезналКонечныйОстаток КАК СуммаНП_БезналКонечныйОстаток
			 |ПОМЕСТИТЬ ВТ_НПНеПартнеров
			 |ИЗ
			 |	РегистрНакопления.ES_НаложенныеПлатежи.ОстаткиИОбороты(
			 |			,
			 |			,
			 |			,
			 |			,
			 |			Заказ В
			 |				(ВЫБРАТЬ
			 |					ВТ_НеДоставкаПартнерами.Заказ
			 |				ИЗ
			 |					ВТ_НеДоставкаПартнерами КАК ВТ_НеДоставкаПартнерами)) КАК ES_НаложенныеПлатежиОстаткиИОбороты
			 |;
			 |
			 |////////////////////////////////////////////////////////////////////////////////
			 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 |	ES_НаложенныеПлатежиПартнеровОбороты.Заказ КАК Заказ,
			 |	ES_НаложенныеПлатежиПартнеровОбороты.Заказ.Контрагент КАК Заказчик,
			 |	ЕСТЬNULL(ES_НаложенныеПлатежиПартнеровОбороты.НПФактНалОборот, 0) + ЕСТЬNULL(ES_НаложенныеПлатежиПартнеровОбороты.НПФактБезналОборот, 0) КАК СуммаНППриход,
			 |	ES_НаложенныеПлатежиПартнеровОбороты.НПФактНалОборот КАК СуммаНППлатежНал,
			 |	ES_НаложенныеПлатежиПартнеровОбороты.НПФактБезналОборот КАК СуммаНППлатежБезНал
			 |ПОМЕСТИТЬ ВТ_НППартнеров
			 |ИЗ
			 |	РегистрНакопления.ES_НаложенныеПлатежиПартнеров.Обороты(
			 |			,
			 |			,
			 |			,
			 |			Заказ В
			 |				(ВЫБРАТЬ
			 |					ВТ_ДоставкаПартнерами.Заказ
			 |				ИЗ
			 |					ВТ_ДоставкаПартнерами КАК ВТ_ДоставкаПартнерами)) КАК ES_НаложенныеПлатежиПартнеровОбороты
			 |ГДЕ
			 |	ЕСТЬNULL(ES_НаложенныеПлатежиПартнеровОбороты.НПФактНалОборот, 0) + ЕСТЬNULL(ES_НаложенныеПлатежиПартнеровОбороты.НПФактБезналОборот, 0) > 0
			 |;
			 |
			 |////////////////////////////////////////////////////////////////////////////////
			 |ВЫБРАТЬ
			 |	ВТ_НП.Заказчик КАК Заказчик,
			 |	ВТ_НП.Заказ КАК Заказ,
			 |	ВТ_НП.СуммаНППлатеж КАК СуммаНППлатеж,
			 |	ВТ_НП.СуммаНППлатежНал КАК СуммаНППлатежНал,
			 |	ВТ_НП.СуммаНППлатежБезнал КАК СуммаНППлатежБезнал,
			 |	ВТ_НП.СуммаНП_НалКонечныйОстаток КАК СуммаНП_НалКонечныйОстаток,
			 |	ВТ_НП.СуммаНП_БезналКонечныйОстаток КАК СуммаНП_БезналКонечныйОстаток
			 |ПОМЕСТИТЬ ВТ_НП
			 |ИЗ
			 |	ВТ_НПНеПартнеров КАК ВТ_НП
			 |
			 |ОБЪЕДИНИТЬ ВСЕ
			 |
			 |ВЫБРАТЬ
			 |	ВТ_НППартнеров.Заказчик,
			 |	ВТ_НППартнеров.Заказ,
			 |	ВТ_НППартнеров.СуммаНППриход,
			 |	ВТ_НППартнеров.СуммаНППлатежНал,
			 |	ВТ_НППартнеров.СуммаНППлатежБезНал,
			 |	ВТ_НППартнеров.СуммаНППлатежНал,
			 |	ВТ_НППартнеров.СуммаНППлатежБезНал
			 |ИЗ
			 |	ВТ_НППартнеров КАК ВТ_НППартнеров
			 |;
			 |
			 |////////////////////////////////////////////////////////////////////////////////
			 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 |	ВТ.Заказ КАК Заказ,
			 |	ВТ.Дата КАК ДатаЗаказа,
			 |	ВТ.Номер КАК НомерЗаказа,
			 |	ВТ.ДатаДоставки КАК ДатаДоставки,
			 |	ВТ.ВидДоставки КАК ВидДоставки,
			 |	ВТ.Организация КАК Организация,
			 |	ВТ.НомерНакладной КАК НомерНакладной,
			 |	ВТ.Получатель КАК Получатель,
			 |	ВТ.СтатусЗаказа КАК СтатусЗаказа,
			 |	ВТ.ОбщийВес КАК Вес,
			 |	ЕСТЬNULL(ВТ_Касса.КассаНП, НЕОПРЕДЕЛЕНО) КАК Касса,
			 |	ЕСТЬNULL(ВТ_Счет.КассаНП, НЕОПРЕДЕЛЕНО) КАК Счет,
			 |	ЕСТЬNULL(ВТ_НП.СуммаНППлатеж, 0) КАК НПФакт,
			 |	ЕСТЬNULL(ВТ_НП.СуммаНППлатежНал, 0) КАК НПФактНал_1,
			 |	ЕСТЬNULL(ВТ_НП.СуммаНППлатежБезнал, 0) КАК НПФактБезнал_1,
			 |	ЕСТЬNULL(ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Значение, """") КАК Комментарий,
			 |	ЕСТЬNULL(ВТ_НП.СуммаНП_НалКонечныйОстаток, 0) КАК НПФактНал,
			 |	ЕСТЬNULL(ВТ_НП.СуммаНП_БезналКонечныйОстаток, 0) КАК НПФактБезнал,
			 |	ВТ.СтоимостьДоставки КАК Стоимость,
			 |	ВТ.Плательщик КАК Плательщик,
			 |	ВТ.ЧекНаОбщуюСумму КАК ЧекНаОбщуюСумму,
			 |	ВТ.ЗачетНП КАК ЗачетНП
			 |ПОМЕСТИТЬ Вт_Общая
			 |ИЗ
			 |	ВТ КАК ВТ
			 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Касса КАК ВТ_Касса
			 |		ПО ВТ.Заказ = ВТ_Касса.Заказ
			 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Счет КАК ВТ_Счет
			 |		ПО ВТ.Заказ = ВТ_Счет.Заказ
			 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НП КАК ВТ_НП
			 |		ПО ВТ.Заказ = ВТ_НП.Заказ
			 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ES_ИзменяемыеРеквизитыЗаказов.СрезПоследних(
			 |				,
			 |				Заказ В
			 |						(ВЫБРАТЬ
			 |							ВТ.Заказ
			 |						ИЗ
			 |							ВТ КАК ВТ)
			 |					И РеквизитЗаказа = ЗНАЧЕНИЕ(Перечисление.ES_ИзменяемыеРеквизитыЗаказа.Комментарий)) КАК ES_ИзменяемыеРеквизитыЗаказовСрезПоследних
			 |		ПО ВТ.Заказ = ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Заказ
			 |;
			 |
			 |////////////////////////////////////////////////////////////////////////////////
			 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 |	Вт_Общая.Заказ КАК Заказ,
			 |	Вт_Общая.НПФактНал КАК НПФактНал,
			 |	Вт_Общая.НПФактНал_1 КАК НПФактНал_1,
			 |	NULL КАК НПФактБезнал,
			 |	NULL КАК НПФактБезнал_1,
			 |	Вт_Общая.ДатаЗаказа КАК ДатаЗаказа,
			 |	Вт_Общая.НомерЗаказа КАК НомерЗаказа,
			 |	Вт_Общая.ДатаДоставки КАК ДатаДоставки,
			 |	Вт_Общая.ВидДоставки КАК ВидДоставки,
			 |	Вт_Общая.Организация КАК Организация,
			 |	Вт_Общая.НомерНакладной КАК НомерНакладной,
			 |	Вт_Общая.Получатель КАК Получатель,
			 |	Вт_Общая.СтатусЗаказа КАК СтатусЗаказа,
			 |	Вт_Общая.Вес КАК Вес,
			 |	Вт_Общая.Касса КАК Касса,
			 |	NULL КАК Счет,
			 |	Вт_Общая.Комментарий КАК Комментарий,
			 |	Вт_Общая.Стоимость КАК Стоимость,
			 |	Вт_Общая.Плательщик КАК Плательщик,
			 |	Вт_Общая.ЧекНаОбщуюСумму КАК ЧекНаОбщуюСумму,
			 |	Вт_Общая.ЗачетНП КАК ЗачетНП
			 |ПОМЕСТИТЬ ВТ_Итог
			 |ИЗ
			 |	Вт_Общая КАК Вт_Общая
			 |ГДЕ
			 |	Вт_Общая.НПФактНал > 0
			 |
			 |ОБЪЕДИНИТЬ ВСЕ
			 |
			 |ВЫБРАТЬ
			 |	Вт_Общая.Заказ,
			 |	NULL,
			 |	NULL,
			 |	Вт_Общая.НПФактБезнал,
			 |	Вт_Общая.НПФактБезнал_1,
			 |	Вт_Общая.ДатаЗаказа,
			 |	Вт_Общая.НомерЗаказа,
			 |	Вт_Общая.ДатаДоставки,
			 |	Вт_Общая.ВидДоставки,
			 |	Вт_Общая.Организация,
			 |	Вт_Общая.НомерНакладной,
			 |	Вт_Общая.Получатель,
			 |	Вт_Общая.СтатусЗаказа,
			 |	Вт_Общая.Вес,
			 |	NULL,
			 |	Вт_Общая.Счет,
			 |	Вт_Общая.Комментарий,
			 |	Вт_Общая.Стоимость,
			 |	Вт_Общая.Плательщик,
			 |	Вт_Общая.ЧекНаОбщуюСумму,
			 |	Вт_Общая.ЗачетНП
			 |ИЗ
			 |	Вт_Общая КАК Вт_Общая
			 |ГДЕ
			 |	Вт_Общая.НПФактБезнал > 0
			 |;
			 |
			 |////////////////////////////////////////////////////////////////////////////////
			 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 |	ВТ_Итог.Заказ КАК Заказ,
			 |	ВТ_Итог.НПФактНал КАК НПФактНал,
			 |	ВТ_Итог.НПФактНал_1 КАК НПФактНал_1,
			 |	ВТ_Итог.НПФактБезнал КАК НПФактБезнал,
			 |	ВТ_Итог.НПФактБезнал_1 КАК НПФактБезнал_1,
			 |	ВТ_Итог.ДатаЗаказа КАК ДатаЗаказа,
			 |	ВТ_Итог.НомерЗаказа КАК НомерЗаказа,
			 |	ВТ_Итог.ДатаДоставки КАК ДатаДоставки,
			 |	ВТ_Итог.ВидДоставки КАК ВидДоставки,
			 |	ВТ_Итог.Организация КАК Организация,
			 |	ВТ_Итог.НомерНакладной КАК НомерНакладной,
			 |	ВТ_Итог.Получатель КАК Получатель,
			 |	ВТ_Итог.СтатусЗаказа КАК СтатусЗаказа,
			 |	ВТ_Итог.Вес КАК Вес,
			 |	ВТ_Итог.Касса КАК Касса,
			 |	ВТ_Итог.Счет КАК Счет,
			 |	ВТ_Итог.Комментарий КАК Комментарий,
			 |	ВТ_Итог.Стоимость КАК Стоимость,
			 |	ВТ_Итог.Плательщик КАК Плательщик,
			 |	ВТ_Итог.ЧекНаОбщуюСумму КАК ЧекНаОбщуюСумму,
			 |	ВТ_Итог.ЗачетНП КАК ЗачетНП,
			 |	ВТ_Итог.Заказ.ES_Проблема КАК Проблема
			 |ИЗ
			 |	ВТ_Итог КАК ВТ_Итог
			 |ГДЕ
			 |	ВЫБОР
			 |			КОГДА ЕСТЬNULL(ВТ_Итог.НПФактНал, 0) > 0
			 |				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
			 |			КОГДА ЕСТЬNULL(ВТ_Итог.НПФактБезнал, 0) > 0
			 |				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
			 |			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПустаяСсылка)
			 |		КОНЕЦ = &ВидОплаты";
			
		ИначеЕсли Параметры.ВидПодбора = "Заказы" Тогда
			Элементы.СписокЗаказовНаДоставкуНаложенныйПлатеж.Видимость = Ложь;
			Элементы.СписокЗаказовНаДоставкуНПФактБезнал.Видимость = Ложь;
			Элементы.ОтобранныеЗаказыНаложенныйПлатежНал.Видимость = Ложь;
			Элементы.ОтобранныеЗаказыНПФактБезнал.Видимость = Ложь;
			
			СписокЭлементов = СписокЗаказовДоставки;
			
			// Статус для установки параметром запроса	
			//ЕФСОЛ Несторук 10.08.2016 +
			МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.Отказ);
			МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.Отменен);
			МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.ОтмененПринят);
			МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.ЧастичноДоставлен);
			МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.НеправильныйАдрес);
			//ЕФСОЛ Несторук 10.08.2016 -
			//ЕФСОЛ НЕсторук 09-12-16 +
			МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.ЧастичноДоставленРассчитать);
			//ЕФСОЛ НЕсторук 09-12-16 -
			МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.Некондиция);
			//ЕФСОЛ Несторук 10.08.2016 -
			Запрос.УстановитьПараметр("Склад",Параметры.Склад);
			Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ES_ДанныеПоЗаказамСрезПоследних.Заказ КАК Заказ,
			               |	ES_ДанныеПоЗаказамСрезПоследних.ДатаДокумента КАК Дата,
			               |	ES_ДанныеПоЗаказамСрезПоследних.НомерДокумента КАК Номер,
			               |	ES_ДанныеПоЗаказамСрезПоследних.ДатаДоставки КАК ДатаДоставки,
			               |	ES_ДанныеПоЗаказамСрезПоследних.ВидДоставки КАК ВидДоставки,
			               |	ES_ДанныеПоЗаказамСрезПоследних.Организация КАК Организация,
			               |	ES_ДанныеПоЗаказамСрезПоследних.Заказчик КАК Заказчик,
			               |	ES_ДанныеПоЗаказамСрезПоследних.Получатель КАК Получатель,
			               |	ES_ДанныеПоЗаказамСрезПоследних.НомерНакладной КАК НомерНакладной,
			               |	ES_ДанныеПоЗаказамСрезПоследних.ОбщийВес КАК ОбщийВес,
			               |	ЕСТЬNULL(ES_СтатусыЗаказовСрезПоследних.СтатусЗаказа, НЕОПРЕДЕЛЕНО) КАК СтатусЗаказа,
			               |	ES_ДанныеПоЗаказамСрезПоследних.СтоимостьДоставки КАК СтоимостьДоставки,
			               |	ES_ДанныеПоЗаказамСрезПоследних.Плательщик КАК Плательщик
			               |ПОМЕСТИТЬ ВТ
			               |ИЗ
			               |	РегистрСведений.ES_ДанныеПоЗаказам.СрезПоследних(
			               |			,
			               |			Заказчик = &Контрагент
			               |				И Организация = &Организация) КАК ES_ДанныеПоЗаказамСрезПоследних
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ES_СтатусыЗаказов.СрезПоследних(, ) КАК ES_СтатусыЗаказовСрезПоследних
			               |		ПО ES_ДанныеПоЗаказамСрезПоследних.Заказ = ES_СтатусыЗаказовСрезПоследних.Заказ
			               |ГДЕ
			               |	ES_СтатусыЗаказовСрезПоследних.СтатусЗаказа В(&МассивСтатусов)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Заказ КАК Заказ,
			               |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Значение КАК КассаНП
			               |ПОМЕСТИТЬ ВТ_Касса
			               |ИЗ
			               |	РегистрСведений.ES_ИзменяемыеРеквизитыЗаказов.СрезПоследних(
			               |			,
			               |			Заказ В
			               |					(ВЫБРАТЬ
			               |						ВТ.Заказ
			               |					ИЗ
			               |						ВТ КАК ВТ)
			               |				И РеквизитЗаказа = ЗНАЧЕНИЕ(Перечисление.ES_ИзменяемыеРеквизитыЗаказа.Касса)) КАК ES_ИзменяемыеРеквизитыЗаказовСрезПоследних
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Заказ КАК Заказ,
			               |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Значение КАК КассаНП
			               |ПОМЕСТИТЬ ВТ_Счет
			               |ИЗ
			               |	РегистрСведений.ES_ИзменяемыеРеквизитыЗаказов.СрезПоследних(
			               |			,
			               |			Заказ В
			               |					(ВЫБРАТЬ
			               |						ВТ.Заказ
			               |					ИЗ
			               |						ВТ КАК ВТ)
			               |				И РеквизитЗаказа = ЗНАЧЕНИЕ(Перечисление.ES_ИзменяемыеРеквизитыЗаказа.Счет)) КАК ES_ИзменяемыеРеквизитыЗаказовСрезПоследних
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ES_НаложенныеПлатежиОстаткиИОбороты.Заказчик КАК Заказчик,
			               |	ES_НаложенныеПлатежиОстаткиИОбороты.Заказ КАК Заказ,
			               |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНППриход КАК СуммаНППлатеж,
			               |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНП_НалПриход КАК СуммаНППлатежНал,
			               |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНП_БезналПриход КАК СуммаНППлатежБезнал,
			               |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНП_НалКонечныйОстаток КАК СуммаНП_НалКонечныйОстаток,
			               |	ES_НаложенныеПлатежиОстаткиИОбороты.СуммаНП_БезналКонечныйОстаток КАК СуммаНП_БезналКонечныйОстаток
			               |ПОМЕСТИТЬ ВТ_НП
			               |ИЗ
			               |	РегистрНакопления.ES_НаложенныеПлатежи.ОстаткиИОбороты(
			               |			,
			               |			,
			               |			,
			               |			,
			               |			Заказ В
			               |				(ВЫБРАТЬ
			               |					ВТ.Заказ
			               |				ИЗ
			               |					ВТ КАК ВТ)) КАК ES_НаложенныеПлатежиОстаткиИОбороты
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	МАКСИМУМ(ES_ТоварыОстатки.Склад) КАК Склад,
			               |	ES_ТоварыОстатки.Заказ КАК Заказ
			               |ПОМЕСТИТЬ ВТ_Склад
			               |ИЗ
			               |	РегистрНакопления.ES_ЗаказыНаСкладе.Остатки(
			               |			&ТекДата,
			               |			Заказ В
			               |				(ВЫБРАТЬ
			               |					ВТ.Заказ
			               |				ИЗ
			               |					ВТ КАК ВТ)) КАК ES_ТоварыОстатки
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ES_ТоварыОстатки.Заказ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Заказ КАК Заказ,
			               |	ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Значение КАК Ячейка
			               |ПОМЕСТИТЬ ВТ_Ячейка
			               |ИЗ
			               |	РегистрСведений.ES_ИзменяемыеРеквизитыЗаказов.СрезПоследних(
			               |			,
			               |			Заказ В
			               |					(ВЫБРАТЬ
			               |						ВТ.Заказ
			               |					ИЗ
			               |						ВТ КАК ВТ)
			               |				И РеквизитЗаказа = ЗНАЧЕНИЕ(Перечисление.ES_ИзменяемыеРеквизитыЗаказа.Ячейка)) КАК ES_ИзменяемыеРеквизитыЗаказовСрезПоследних
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ВТ.Заказ КАК Заказ,
			               |	ВТ.Дата КАК ДатаЗаказа,
			               |	ВТ.Номер КАК НомерЗаказа,
			               |	ВТ.ДатаДоставки КАК ДатаДоставки,
			               |	ВТ.ВидДоставки КАК ВидДоставки,
			               |	ВТ.Организация КАК Организация,
			               |	ВТ.НомерНакладной КАК НомерНакладной,
			               |	ВТ.Получатель КАК Получатель,
			               |	ВТ.СтатусЗаказа КАК СтатусЗаказа,
			               |	ВТ.ОбщийВес КАК Вес,
			               |	ЕСТЬNULL(ВТ_Касса.КассаНП, НЕОПРЕДЕЛЕНО) КАК Касса,
			               |	ЕСТЬNULL(ВТ_Счет.КассаНП, НЕОПРЕДЕЛЕНО) КАК Счет,
			               |	ЕСТЬNULL(ВТ_НП.СуммаНППлатеж, 0) КАК НПФакт,
			               |	ЕСТЬNULL(ВТ_НП.СуммаНППлатежНал, 0) КАК НПФактНал_1,
			               |	ЕСТЬNULL(ВТ_НП.СуммаНППлатежБезнал, 0) КАК НПФактБезнал_1,
			               |	ЕСТЬNULL(ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Значение, """") КАК Комментарий,
			               |	ЕСТЬNULL(ВТ_НП.СуммаНП_НалКонечныйОстаток, 0) КАК НПФактНал,
			               |	ЕСТЬNULL(ВТ_НП.СуммаНП_БезналКонечныйОстаток, 0) КАК НПФактБезнал,
			               |	ВТ.СтоимостьДоставки КАК Стоимость,
			               |	ВТ.Плательщик КАК Плательщик,
			               |	ЕСТЬNULL(ВТ_Склад.Склад, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК Склад,
			               |	ЕСТЬNULL(ВТ_Ячейка.Ячейка, ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)) КАК Ячейка,
			               |	ВЫБОР
			               |		КОГДА ЕСТЬNULL(ВТ_НП.СуммаНППлатежНал, 0) > 0
			               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
			               |		КОГДА ЕСТЬNULL(ВТ_НП.СуммаНППлатежБезнал, 0) > 0
			               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПустаяСсылка)
			               |	КОНЕЦ КАК ВидОплаты,
			               |	ВТ.Заказ.ES_Проблема КАК Проблема
			               |ИЗ
			               |	ВТ КАК ВТ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Касса КАК ВТ_Касса
			               |		ПО ВТ.Заказ = ВТ_Касса.Заказ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Счет КАК ВТ_Счет
			               |		ПО ВТ.Заказ = ВТ_Счет.Заказ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НП КАК ВТ_НП
			               |		ПО ВТ.Заказ = ВТ_НП.Заказ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ES_ИзменяемыеРеквизитыЗаказов.СрезПоследних(
			               |				,
			               |				Заказ В
			               |						(ВЫБРАТЬ
			               |							ВТ.Заказ
			               |						ИЗ
			               |							ВТ КАК ВТ)
			               |					И РеквизитЗаказа = ЗНАЧЕНИЕ(Перечисление.ES_ИзменяемыеРеквизитыЗаказа.Комментарий)) КАК ES_ИзменяемыеРеквизитыЗаказовСрезПоследних
			               |		ПО ВТ.Заказ = ES_ИзменяемыеРеквизитыЗаказовСрезПоследних.Заказ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Склад КАК ВТ_Склад
			               |		ПО ВТ.Заказ = ВТ_Склад.Заказ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ячейка КАК ВТ_Ячейка
			               |		ПО ВТ.Заказ = ВТ_Ячейка.Заказ
			               |ГДЕ
			               |	ВТ_Склад.Склад = &Склад";
			
		КонецЕсли;

	//Если Не ТекСтатус = Неопределено Тогда
		Запрос.Текст = ТекстЗапроса;
		
		Запрос.УстановитьПараметр("Контрагент", Параметры.Контрагент);
		Запрос.УстановитьПараметр("ВидОплаты", Параметры.ВидОплаты);
		Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
		ЗАпрос.УстановитьПараметр("Организация", Организация);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если Параметры.ВидОплаты = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") И
					Параметры.ВидЗачета = ПредопределенноеЗначение("Перечисление.ES_ВидыЗачетаПоПлатежамВозврата.Взаимозачет") 
					Тогда
					Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НПФактНал) Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(СписокЭлементов.Добавить(), ВыборкаДетальныеЗаписи);
			КонецЦикла;
		КонецЕсли; 
		
	//КонецЕсли;
	
	// Если элементы к возврату не найдены, не открываем форму
	Если СписокЭлементов.Количество() = 0 Тогда
		Отказ = Истина;
	КонецЕсли; 
		
	//}ЭР Несторук С.И.
	
	//ЭР Несторук С.И. 10.05.2017 10:17:33 {
	ИспользоватьЯчейки = ПолучитьФункциональнуюОпцию("УчетПоЯчейкам");
	Элементы.ОтобранныеЗаказыЯчейка.Видимость 			= ИспользоватьЯчейки;
	Элементы.СписокЗаказовНаДоставкуЯчейка.Видимость 	= ИспользоватьЯчейки;
	//}ЭР Несторук С.И.
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	ВозвращаемыйМассив = Новый Массив;
	Если Элементы.ГруппаЗаказы.Видимость = Истина Тогда 	
		Для каждого Элемент Из ОтобранныеЗаказы Цикл
			ВозвращаемыйМассив.Добавить(Элемент.Заказ);
		КонецЦикла;
	КонецЕсли; 
	ТЗ = ОКСервер();
	//Закрыть(ВозвращаемыйМассив);
	Закрыть(ТЗ);
	
КонецПроцедуры

&НаСервере
Функция  ОКСервер()
	
	 Возврат ТаблицаЗначенийВМассив(ОтобранныеЗаказы.Выгрузить());
	
КонецФункции

Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт
    
    Массив = Новый Массив();
    СтруктураСтрокой = "";
    НужнаЗапятая = Ложь;
    Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
        Если НужнаЗапятая Тогда
            СтруктураСтрокой = СтруктураСтрокой + ",";
        КонецЕсли;
        СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
        НужнаЗапятая = Истина;
    КонецЦикла;
    Для Каждого Строка Из ТаблицаЗначений Цикл
        НоваяСтрока = Новый Структура(СтруктураСтрокой);
        ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
        Массив.Добавить(НоваяСтрока);
    КонецЦикла;
    Возврат Массив;


КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ ЗАКАЗЫ

&НаКлиенте
Процедура СортировкаЗаказовПриИзменении(Элемент)
	
	Если СортировкаЗаказов = 1 Тогда
		СписокЗаказовДоставки.Сортировать("НомерНакладной");
	ИначеЕсли СортировкаЗаказов = 2 Тогда 
		СписокЗаказовДоставки.Сортировать("ДатаЗаказа");
	ИначеЕсли СортировкаЗаказов = 3 Тогда 
		СписокЗаказовДоставки.Сортировать("ДатаДоставки");
	ИначеЕсли СортировкаЗаказов = 4 Тогда 
		СписокЗаказовДоставки.Сортировать("Получатель");
	ИначеЕсли СортировкаЗаказов = 5 Тогда 
		СписокЗаказовДоставки.Сортировать("Организация");
	ИначеЕсли СортировкаЗаказов = 6 Тогда 
		СписокЗаказовДоставки.Сортировать("Касса");
	КонецЕсли;
	
	Элементы.СписокЗаказовНаДоставку.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовНаДоставкуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Заказ", ТекущаяСтрока.Заказ);
	СтруктураПоиска.Вставить("Касса", ТекущаяСтрока.Касса);
	СтруктураПоиска.Вставить("Счет", ТекущаяСтрока.Счет);
	Строки = ОтобранныеЗаказы.НайтиСтроки(СтруктураПоиска);
	
	Если Строки.Количество() = 0 Тогда
		НоваяСтрока = ОтобранныеЗаказы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЕсли;
	
	СписокЗаказовДоставки.Удалить(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовНаДоставкуНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Структура = Новый Структура;
	Структура.Вставить("Заказ", 		ТекущиеДанные.Заказ);
	Структура.Вставить("ДатаЗаказа", 	ТекущиеДанные.ДатаЗаказа);
	Структура.Вставить("НомерЗаказа", 	ТекущиеДанные.НомерЗаказа);
	Структура.Вставить("СтатусЗаказа", 	ТекущиеДанные.СтатусЗаказа);
	Структура.Вставить("Касса", 		ТекущиеДанные.Касса);
	Структура.Вставить("Счет", 			ТекущиеДанные.Счет);
	Структура.Вставить("НПФактНал", 	ТекущиеДанные.НПФактНал);
	Структура.Вставить("НПФактБезнал", 	ТекущиеДанные.НПФактБезнал);
	Структура.Вставить("ЧекНаОбщуюСумму", 	ТекущиеДанные.ЧекНаОбщуюСумму);
	Структура.Вставить("ЗачетНП", 			ТекущиеДанные.ЗачетНП);
	
	ПараметрыПеретаскивания.Значение = Структура;
	
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобранныеЗаказыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобранныеЗаказыПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	СтруктураПоиска = Новый Структура("Заказ", ТекущаяСтрока.Заказ);
	Строки = СписокЗаказовДоставки.НайтиСтроки(СтруктураПоиска);
	
	Если Строки.Количество() = 0 Тогда
		НоваяСтрока = СписокЗаказовДоставки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобранныеЗаказыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
		
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобранныеЗаказыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
		
	СтандартнаяОбработка = Ложь;
	
	ПараметрыСтруктура = ПараметрыПеретаскивания.Значение;
	
	Если НЕ ТипЗнч(ПараметрыСтруктура) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Заказ", ПараметрыСтруктура.Заказ);
	Строки = ОтобранныеЗаказы.НайтиСтроки(СтруктураПоиска);
	
	Если Строки.Количество() = 0 Тогда
		НоваяСтрока = ОтобранныеЗаказы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыСтруктура);
	Иначе
		НоваяСтрока = Строки[0];
	КонецЕсли;
	
	Элементы.ОтобранныеЗаказы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
	УдаляемаяСтрока = СписокЗаказовДоставки.НайтиСтроки(СтруктураПоиска);
	СписокЗаказовДоставки.Удалить(УдаляемаяСтрока[0]);

КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсе(Команда)
	//ЕФСОЛ Несторук 28.07.2016 + 
	Для каждого Строка Из СписокЗаказовДоставки Цикл
		НовыйОтобранныйЗаказ = ОтобранныеЗаказы.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйОтобранныйЗаказ, Строка);
	КонецЦикла;
	СписокЗаказовДоставки.Очистить();
	//ЕФСОЛ Несторук 28.07.2016 -

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//УстановитьВидимостьКолонок();
	
КонецПроцедуры

&НаСервере
Процедура  УстановитьВидимостьКолонок(ВидЗачета, ВидПодбора = "")
	//ЕФСОЛ Несторук 28.07.2016 + 	
	Если ВидЗачета = ПредопределенноеЗначение("Перечисление.ES_ВидыЗачетаПоПлатежамВозврата.Взаимозачет") Тогда
		Элементы.СписокЗаказовНаДоставкуСтоимость.Видимость = Истина;
		//Элементы.СписокЗаказовНаДоставкуПлательщик.Видимость = Истина;
		Элементы.ОтобранныеЗаказыСтоимость.Видимость = Истина;
		//Элементы.ОтобранныеЗаказыПлательщик.Видимость = Истина;
	Иначе
		Элементы.СписокЗаказовНаДоставкуСтоимость.Видимость = Ложь;
		//Элементы.СписокЗаказовНаДоставкуПлательщик.Видимость = Ложь;
		Элементы.ОтобранныеЗаказыСтоимость.Видимость = Ложь;
		//Элементы.ОтобранныеЗаказыПлательщик.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СписокЗаказовНаДоставкуОтправлено.Видимость = ВидПодбора = "ПеремещениеПлатежи";
	Элементы.ОтобранныеЗаказыОтправлено.Видимость = ВидПодбора = "ПеремещениеПлатежи";
	Элементы.СписокЗаказовНаДоставкуАдресДоставки.Видимость = ВидПодбора = "ПеремещениеЗаказы";
	Элементы.ОтобранныеЗаказыАдресДоставки.Видимость = ВидПодбора = "ПеремещениеЗаказы";
	//ЕФСОЛ Несторук 28.07.2016 -

КонецПроцедуры

&НаКлиенте
Процедура ОтборПроблемаПриИзменении(Элемент)
	УстновитьОтборВТЧ();
КонецПроцедуры

&НаКлиенте
Процедура УстновитьОтборВТЧ()
	Структура = Новый СТруктура;
	Если ОтборБезПроблемных Тогда
		Структура.Вставить("Проблема", Ложь);
	КонецЕсли;
	
	ФиксСтруктура = Новый ФиксированнаяСтруктура(Структура);
	Элементы.СписокЗаказовНаДоставку.ОтборСтрок = ФиксСтруктура;
	
	
КонецПроцедуры
